# Fixed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Fixed Property
UnitTypeId Class See Also
---
Fixed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Fixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Fixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Fixed {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace